app/controllers/api/shop_controller.rb

SELECT  `products`.* FROM `products` WHERE `products`.`name` = '\'Supah Warbird\'' LIMIT 1
SELECT `products`.* FROM `products`
---
    def show
      # param for returning only products that are in stock
      in_stock = params['in_stock']
      # params for returning only a single product using name or id
      product_name = params['name']
      product_id = params['item_id']
      # Capitalize productName to match names in table and attempt to find product
      if product_name.present?
        product_name.capitalize
        @products = Product.find_by(name: product_name)
        if @products.nil?
          @products = { 'Error': 'Product with inputted name not found' }
        end
      # Attempt to find product using item_id
      elsif product_id.present?
        @products = Product.find_by(item_id: product_id)
        if @products.nil?
          @products = { 'Error': 'Product with inputted item_id not found' }
        end
      elsif in_stock
        @products = Product.where('quantity > 0')
      else
        @products = Product.all

SELECT  `products`.* FROM `products` WHERE `products`.`name` = 'Supah Warbird' LIMIT 1
SELECT  `carts`.* FROM `carts` WHERE `carts`.`item_id` = 7397489 LIMIT 1
INSERT INTO `carts` (`name`, `description`, `item_id`, `price`, `quantity`, `created_at`, `updated_at`) VALUES ('Supah Warbird', 'Durability', 7397489, 92.07, 2, '2019-01-18 03:28:19', '2019-01-18 03:28:19')
---
    def add_to_cart
      # Params to find product and how much to place in cart
      product_name = params['name']
      product_id = params['item_id']
      product_quantity = params['quantity'].to_s

      # Making sure necessary params are not empty
      if (product_name.empty? && product_id.empty?) || product_quantity.empty?
        @return = { 'Error': 'Quantity must be specified'} if product_quantity.empty?
        @return = { 'Error': 'One of name or item_id must be specified' } if product_id.empty? && product_name.empty?
        @return = { 'Error': 'Quantity and one of name or item_id must be specified' } if product_id.empty? && product_name.empty? && product_quantity.empty?
      else
        # Finding product
        if product_name.present?
          product_name.capitalize
          @return = Product.find_by(name: product_name)
        else
          @return = Product.find_by(item_id: product_id)
        end

        if @return.nil? # Making sure product was found
          @return = { 'Error': 'Product not found' }
        else
          stock = @return.quantity

          if stock == 0
            @return = { 'Error': 'Product is sold out' }
          elsif stock < product_quantity.to_i
            @return = { 'Error': 'Not enough stock left to meet quantity' }
          else
            if Cart.find_by(item_id: @return.item_id).present?
              @return = { 'Error': 'Product already exists in cart'}
            else
              Cart.create(name: @return.name, description: @return.description, item_id: @return.item_id, price: @return.price, quantity: product_quantity)

DELETE FROM `carts` WHERE `carts`.`id` = 3
---
    def complete_cart
      render json: { status: 'Success', message: 'Checkout Complete! Thank you for shopping with us!', data: products_in_cart(true) }
      Cart.destroy_all

SELECT `carts`.* FROM `carts`
SELECT  `products`.* FROM `products` WHERE `products`.`name` = 'Supah Warbird' LIMIT 1
UPDATE `products` SET `quantity` = 23 WHERE `products`.`id` = 1
---
    def products_in_cart (complete)
      cart = []
      @total = 0
      Cart.all.each do |item|
        product_total = item.quantity * item.price
        @total += product_total
        cart.append('Name': item.name,
                    'Description': item.description,
                    'Item ID': item.item_id,
                    'Price': item.price,
                    'Quantity': item.quantity,
                    'Subtotal': "$#{product_total.round(2)}")
        if complete
          product = Product.find_by(name: item.name)
          product.update_columns(quantity: product.quantity - item.quantity)